[
  {
    "client": "Nohmad Snack Co.",
    "workType": "Shopify Store Enhancement",
    "description": "Enhanced user experience for Nohmad Snack Co., a startup chocolate company, by customizing their Shopify store template using Liquid, JavaScript, and CSS. Quickly overcame challenges in familiarizing with Shopify's theme functionality. Notably, modifying the product page to display a selected hero image over the theme's default of a variant specific image, enhancing visual appeal and engagement, and creating custom accordion components with animations to elegantly display product attributes.",
    "link": "https://www.nohmadsnackco.com"
  },
  {
    "client": "Friday Beers",
    "workType": "Squarespace Site Customization",
    "description": "Assisted the Friday Beers team with a site for their new beer launch, implementing custom CSS for their Squarespace site. Some examples of work done in this project include addressing alignment issues, preventing layout shifts on form submission, and applying custom fonts to site popups. Overcame a unique problem, an animated custom cursor featuring the client's beer icon (though not used in the final implementation) that crushed on click. Assisted in styling a store locator to match the site theme. The project manager praised the swift and effective completion of tasks, contributing to the successful launch of this high-profile Instagram channel's new product.",
    "link": "https://www.fridaybeers.com"
  },
  {
    "client": "David M. Budd Photography",
    "workType": "Custom Next.js Application",
    "description": "Developed a responsive, app-like portfolio website for Denver-based photographer David M. Budd to display his work as best as possible on all devices. Employed Next's server-side rendering, Image components and custom functions for optimal image loading, consistently achieving a Google Page Speed performance scores over 95 for mobile users without compromising image quality. Cleared security violations with Google due to the previous site iteration being hacked, and enhanced technical SEO through semantic HTML, WCAG compliance, sitemap creation, metadata optimization, and Google Search Console indexing. Received client accolades for this fully custom site, workflow transparency, and SEO assistance.",
    "link": "https://www.davidmbuddphotography.com"
  },
  {
    "client": "Studio27",
    "workType": "WordPress Site Revamp",
    "description": "Updated Studio27's decade-old website, a professional Denver-based photography company, providing a fresh look and improved UX for their portfolio display. Tweaked the WordPress theme's CSS to align with client preferences, including layout adjustments, color changes, and element removals. The client commended the collaborative process, timeline management, and the elevation of project quality, highlighting the smooth development process and successful outcome",
    "link": "https://www.studio2seven.com"
  }
]
